{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 2], "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "name": "embedding_1", "mask_zero": false, "input_dim": 838, "embeddings_regularizer": null, "input_length": 2, "activity_regularizer": null, "embeddings_constraint": null, "output_dim": 128, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"stateful": false, "bias_constraint": null, "implementation": 1, "recurrent_constraint": null, "activation": "tanh", "bias_regularizer": null, "dropout": 0.0, "recurrent_dropout": 0.0, "return_sequences": false, "return_state": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "unit_forget_bias": true, "kernel_constraint": null, "name": "lstm_1", "use_bias": true, "unroll": false, "recurrent_activation": "hard_sigmoid", "units": 200, "recurrent_regularizer": null, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "units": 838, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}], "keras_version": "2.1.6"}