{"class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "activity_regularizer": null, "trainable": true, "input_dim": 6035, "batch_input_shape": [null, 2], "embeddings_constraint": null, "input_length": 2, "mask_zero": false, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "name": "embedding_1", "dtype": "float32"}}, {"class_name": "LSTM", "config": {"unit_forget_bias": true, "return_state": false, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "unroll": false, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "name": "lstm_1", "implementation": 1, "go_backwards": false, "recurrent_regularizer": null, "activity_regularizer": null, "trainable": true, "dropout": 0.0, "return_sequences": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 200, "recurrent_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "units": 6035, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1"}}], "backend": "tensorflow"}