{"keras_version": "2.1.6", "config": [{"config": {"embeddings_constraint": null, "embeddings_regularizer": null, "input_length": 66, "input_dim": 838, "mask_zero": false, "name": "embedding_1", "activity_regularizer": null, "output_dim": 128, "batch_input_shape": [null, 66], "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "dtype": "float32", "trainable": true}, "class_name": "Embedding"}, {"config": {"recurrent_constraint": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "lstm_1", "activity_regularizer": null, "unroll": false, "units": 200, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "activation": "tanh", "dropout": 0.2, "implementation": 1, "recurrent_dropout": 0.2, "stateful": false, "unit_forget_bias": true, "kernel_constraint": null, "return_sequences": false, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "activity_regularizer": null, "units": 838, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}