{"config": [{"config": {"batch_input_shape": [null, 2], "name": "embedding_2", "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "mask_zero": false, "embeddings_regularizer": null, "input_length": 2, "input_dim": 6035, "activity_regularizer": null, "trainable": true, "output_dim": 128, "dtype": "float32", "embeddings_constraint": null}, "class_name": "Embedding"}, {"config": {"unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "return_sequences": false, "bias_regularizer": null, "return_state": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "implementation": 1, "use_bias": true, "units": 200, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "activity_regularizer": null, "activation": "tanh", "name": "lstm_2", "stateful": false, "bias_constraint": null, "dropout": 0.0, "trainable": true, "go_backwards": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "name": "dense_2", "trainable": true, "use_bias": true, "units": 6035, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow"}