{"keras_version": "2.1.6", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "batch_input_shape": [null, 57], "dtype": "float32", "input_length": 57, "output_dim": 128, "embeddings_constraint": null, "mask_zero": false, "name": "embedding_1", "trainable": true, "embeddings_regularizer": null, "input_dim": 505}}, {"class_name": "LSTM", "config": {"return_sequences": false, "units": 200, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "use_bias": true, "dropout": 0.2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unroll": false, "name": "lstm_1", "bias_regularizer": null, "implementation": 1, "recurrent_dropout": 0.2, "kernel_constraint": null, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "activation": "tanh", "return_state": false, "trainable": true, "stateful": false, "unit_forget_bias": true, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"units": 505, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true, "bias_regularizer": null, "activity_regularizer": null}}]}