{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 2], "name": "embedding_1", "dtype": "float32", "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "input_dim": 505, "embeddings_regularizer": null, "embeddings_constraint": null, "activity_regularizer": null, "input_length": 2, "mask_zero": false, "output_dim": 128}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "unroll": false, "return_sequences": false, "trainable": true, "use_bias": true, "go_backwards": false, "activation": "tanh", "implementation": 1, "return_state": false, "units": 200, "recurrent_dropout": 0.0, "bias_constraint": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "stateful": false, "dropout": 0.0, "bias_regularizer": null, "activity_regularizer": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activity_regularizer": null, "units": 505, "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.6"}